;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; used
(package! olivetti)
(package! openwith)
(package! pandoc-mode)
(package! org-auto-tangle)
(package! super-save)
(package! citeproc)

;; unused
;; (package! insert-shebang)
;; (package! autothemer)

;; Custom Themes
(package! kanagawa-theme)
(package! catppuccin-theme)
(package! eink-theme)
